In [1]:
import numpy as np
import pandas as pd

In [4]:
df=pd.read_csv("C:\\Users\\A\\Code__basic.csv")
df

        Name    Income
0        Rob      5000
1      Rafic      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [5]:
df.describe()

             Income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [7]:
df.Income.quantile(0.75)

7750.0

In [8]:
df.Income.quantilentile(0.25)

5500.0

In [9]:
df.Income.quantile(0.45)

6700.0

In [11]:
df.Income.quantile(0.25,interpolation="lower")

5000

In [12]:
df.Income.quantile(0.25,interpolation="higher")

6000

In [13]:
df.Income.quantile(0)

4000.0

In [14]:
df.Income.quantile(1)

10000000.0

In [15]:
Percentile_99=df.Income.quantile(0.99)
Percentile_99

9400479.999999994

In [17]:
# Remove outlier
df_No_Outlier=df[df.Income<=Percentile_99]
df_No_Outlier

    Name  Income
0    Rob    5000
1  Rafic    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [18]:
df

        Name    Income
0        Rob      5000
1      Rafic      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [19]:
df["Income"][3]=np.NaN
df

C:\Users\A\AppData\Local\Temp\ipykernel_4324\872303897.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Income"][3]=np.NaN

        Name      Income
0        Rob      5000.0
1      Rafic      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [20]:
df.Income.mean()

1671666.6666666667

In [22]:
df_New=df.fillna(df.Income.mean())
df_New

        Name        Income
0        Rob  5.000000e+03
1      Rafic  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [23]:
df_New=df.fillna(df.Income.median())
df_New

        Name      Income
0        Rob      5000.0
1      Rafic      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [25]:
df.Income.median()

6500.0